{
    "qstac221": {
        "prereq": "QST SM131; QST SM132 previous or concurrent.",
        "coreq": null,
        "description": "Basic concepts underlying financial statements and accounting procedures used in preparing statements of financial position, income statements, and statements of cash flow. Stresses the interpretation, analysis, and evaluation of published financial statements.",
        "credit": "4",
        "hub credit": null
    },
    "qstba222": {
        "prereq": "CAS EC101, QST QM221, and QST SM131",
        "coreq": null,
        "description": "Examines the use of economic and statistical tools for making business decisions at an advanced level, and prepares students for future study in business analytics. Introduces programming for data analysis (no previous programming knowledge required) and links data analysis to decision making using both spreadsheet modeling and statistical programming. Topics include multiple regression, causal inference, forecasting, predictive analytics, machine learning, demand modeling, and optimization. Case studies apply advanced concepts to practical business problems. Effective Spring 2021, this course fulfills a single unit in the following BU Hub area: Quantitative Reasoning II.",
        "credit": "4",
        "hub credit": [
            "Quantitative Reasoning II"
        ]
    },
    "cdsds380": {
        "prereq": "CDSDS110 AND CDSDS320",
        "coreq": null,
        "description": "This course develops students' ability to critically examine and question the interplay between data science and computational technologies on the one hand, and society and public policy on the other. Students will complete exercises to demonstrate their facility with key ethics tools and techniques, and analyze a series of real-world case studies presented alongside ethical tools and analyses that are useful both for staying alert to emerging ethical challenges and responding to them as they arise in both employment settings and everyday life. Effective Fall 2022, this course fulfills a single unit in each of the following BU Hub areas: Ethical Reasoning, Social Inquiry II, Research and Information Literacy.",
        "credit": "4",
        "hub credit": [
            "Ethical Reasoning",
            "Social Inquiry II",
            "Research and Information Literacy"
        ]
    },
    "cdsds219": {
        "prereq": null,
        "coreq": null,
        "description": "Taught by industry software veterans who serve as Spark! Engineers in Residence in CDS, this 2-credit course presents students with an unadulterated view of what they need to know as they take on software engineering projects, in preparation for careers as full-stack software/data engineers. From a brass tacks perspective, the course covers a number of tactical topics. The course covers the language of modern software development including patterns, source control, pull requests, open source, containerization, virtualization, and agile vs waterfall development methods. Additionally, the course introduces students to a few of the specialized professional software engineering and DevOps roles in industry.",
        "credit": "2",
        "hub credit": null
    },
    "cascs411": {
        "prereq": "CAS CS 112.",
        "coreq": null,
        "description": "Introduction to the construction of reliable software. Topics may include software tools, software testing methodologies, retrofitting, regression testing, structured design and structured programming, software characteristics and quality, complexity, entropy, deadlock, fault tolerance, formal proofs of program correctness, chief program teams, and structured walk-throughs. Effective Fall 2019, this course fulfills a single unit in each of the following BU Hub area: Teamwork/Collaboration.",
        "credit": "4",
        "hub credit": [
            "Teamwork/Collaboration"
        ]
    },
    "cdsds519": {
        "prereq": "CDSDS310 OR CASCS411 OR equivalent experience in software developmentand consent of instructor. Consent provided upon successful completion of pass/fail diagnostic test to assess student readiness fo",
        "coreq": null,
        "description": "This course offers students in computing disciplines the opportunity to apply their programming and system development skills by working on real-world projects provided from partnering organizations within and outside of BU, which are curated by Spark! The course offers a range of project options where students can improve their technical skills, while also gaining the soft skills necessary to deliver projects aligned to the partner's goals. These include teamwork and communications skills and software development processes. All students participating in the course are expected to complete a software engineering project including a final presentation to the partner organization. Effective Spring 2022, this course fulfills a single unit in each of the following BU Hub areas: Ethical Reasoning, Oral and/or Signed Communication, Teamwork/Collaboration.",
        "credit": "4",
        "hub credit": [
            "Ethical Reasoning",
            "Oral and/or Signed Communication",
            "Teamwork/Collaboration"
        ]
    },
    "cascs112": {
        "prereq": "CAS CS 111; or equivalent.",
        "coreq": null,
        "description": "Covers advanced programming techniques and data structures. Topics include recursion, algorithm analysis, linked lists, stacks, queues, trees, graphs, tables, searching, and sorting. Carries MCS divisional credit in CAS. Effective Fall 2018, this course fulfills a single unit in the following BU Hub areas: Quantitative Reasoning II, Creativity/Innovation, Critical Thinking.",
        "credit": "4",
        "hub credit": [
            "Quantitative Reasoning II",
            "Critical Thinking",
            "Creativity/Innovation"
        ]
    },
    "cdsds110": {
        "prereq": null,
        "coreq": null,
        "description": "CDS DS 110 is the first in a two-course sequence (leading to CDS DS 210) that builds students' competence in computing techniques central to data science. Students will use Python to explore fundamental CS concepts and processes used in data science with a focus on descriptive data analysis, including data structures, development of functions and more advanced recursion, object- oriented programming, data processing and data visualization. Numpy, pandas, and matplotlib will be used to analyze real-world data. Prior experience with Python is not required.",
        "credit": "4",
        "hub credit": [
            "Quantitative Reasoning I",
            "Teamwork/Collaboration"
        ]
    },
    "casma214": {
        "prereq": "CAS MA 213; or consent of instructor.",
        "coreq": null,
        "description": "Students may receive credit for not more than one of the following courses: CAS MA 116, MA 214, or MA 614. Inference about proportions, goodness of fit, student's t-distribution, tests for normality; two-sample comparisons, regression and correlation, tests for linearity and outliers, residual analysis, contingency tables, analysis of variance. Carries MCS divisional credit in CAS. Effective Fall 2018, this course fulfills a single unit in each of the following BU Hub areas: Quantitative Reasoning II, Teamwork/Collaboration. Effective Fall 2020, this course fulfills a single unit in each of the following BU Hub areas: Quantitative Reasoning II, Critical Thinking, Teamwork/Collaboration.",
        "credit": "4",
        "hub credit": [
            "Quantitative Reasoning II",
            "Critical Thinking",
            "Teamwork/Collaboration"
        ]
    },
    "cdsds320": {
        "prereq": "CDSDS110 or equivalent AND CDSDS122 or equivalent",
        "coreq": null,
        "description": "This course covers the fundamental principles underlying the design and analysis of algorithms. We will walk through classical design methods, such as greedy algorithms, design and conquer, and dynamic programming, focusing on applications in data science. We will also study algorithmic methods more specific to data science and machine learning. The course places a particular emphasis on algorithmic efficiency, crucial with large and/or streaming data sets, for which multiple scans of data are infeasible, including the use of approximation and randomized algorithms. Effective Spring 2022, this course fulfills a single unit in each of the following BU Hub areas: Quantitative Reasoning II, Critical Thinking.",
        "credit": "4",
        "hub credit": [
            "Quantitative Reasoning II",
            "Critical Thinking"
        ]
    },
    "cdsds310": {
        "prereq": "CDSDS110 AND CDSDS210",
        "coreq": null,
        "description": "Course focused on developing students' capacity to design and implement data flows and the computational workflows meant to inform online/offline decision-making within large systems. Students explore the data science lifecycle, including question formulation, data collection and cleaning (data wrangling), exploratory data analysis and visualization, statistical inference and prediction, and decision-making. Relational (SQL) and MapReduce (noSQL) paradigms used to assemble analysis, optimization, and decision-making algorithms to track and scale data.",
        "credit": "4",
        "hub credit": null
    },
    "cdsds122": {
        "prereq": "CDSDS121 OR equivalent",
        "coreq": null,
        "description": "CDS DS 122 is the third in a three-course sequence (with CDS DS 120 and CDS DS 121) that introduces students to theoretical foundations of Data Science. DS 122 covers topics in probability (including common probability distributions, conditional probability, independence, Bayes Theorem, prior and posterior distributions, sampling, and the central limit theorem), statistics (including maximum likelihood), basic numerical optimization (including gradient descent methods), and topics in calculus (including sequences and series). Knowledge of a programming language (such as Python) is expected. Effective Spring 2022, this course fulfills a single unit in each of the following BU Hub areas: Quantitative Reasoning II, Critical Thinking.",
        "credit": "4",
        "hub credit": [
            "Quantitative Reasoning II",
            "Critical Thinking"
        ]
    },
    "cdsds210": {
        "prereq": "CDSDS110 OR equivalent",
        "coreq": null,
        "description": "Second course in the CDS DS-110-210 sequence. The first half of DS 210 continues the Python programming experience begun in DS-110, with enhanced focus on machine learning applications. The second half of the course introduces students to compiled programming languages, such as Rust, Go and Java, suitable for building large projects. Basic data structures (stacks, queues, priority queues, binary search trees), techniques for representing graphs, and basic graph algorithms will be explored. Concepts are developed and reinforced through consideration of data-driven inquiries in real-world settings. Effective Spring 2022, this course fulfills a single unit in each of the following BU Hub areas: Quantitative Reasoning II, Digital/Multimedia Expression, Creativity/Innovation.",
        "credit": "4",
        "hub credit": [
            "Quantitative Reasoning II",
            "Digital/Multimedia Expression",
            "Creativity/Innovation"
        ]
    },
    "cdsds121": {
        "prereq": "CDSDS120 OR equivalent; CDSDS110 OR equivalent.",
        "coreq": null,
        "description": "CDS 121 is the second in the three-course sequence (CDS DS 120, 121, 122) that introduces students to theoretical foundations of Data Science. DS 121 covers an introduction to key concepts from Linear Algebra (vector space, independence, orthogonality and matrix factorizations). The DS theme running through the course is exploratory data analysis, enabling a better understanding of the data at hand. The course will link mathematical concepts with computational thinking, specifically through the use of problem sets that require students to answer mathematically-posed questions using computation. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Quantitative Reasoning I, Digital/Multimedia Expression, Critical Thinking.",
        "credit": "4",
        "hub credit": [
            "Quantitative Reasoning I",
            "Digital/Multimedia Expression",
            "Critical Thinking"
        ]
    },
    "cgshu202": {
        "prereq": null,
        "coreq": null,
        "description": "The course focuses on the application of philosophical ideas to various areas of modern life, such as politics, science, business, personal development, education, and religious faith. Effective Fall 2018, this course fulfills a single unit in each of the following BU Hub areas: Philosophical Inquiry and Life's Meanings, Ethical Reasoning, Creativity/Innovation.",
        "credit": "4",
        "hub credit": [
            "Philosophical Inquiry and Life's Meanings",
            "Ethical Reasoning",
            "Creativity/Innovation"
        ]
    },
    "cgsns202": {
        "prereq": null,
        "coreq": null,
        "description": "What is the fate of the biosphere and our species? Can humans reconcile economic and technological growth with ecological sustainability? This course examines the impact of one species, Homo sapiens, on the ecosystems of the biosphere, seeking answers to these broad questions. Effective Fall 2018, this course fulfills a single unit in each of the following BU Hub areas: Scientific Inquiry II, Teamwork/Collaboration.",
        "credit": "4",
        "hub credit": [
            "Scientific Inquiry II",
            "Teamwork/CollaborationBU Hub Pathway:  Environment &amp; Society"
        ]
    },
    "qstsm132": {
        "prereq": "SM131 previous or concurrent. CAS MA121/123. Open to non-Questrom students who have completed a semester of FT work at BU.",
        "coreq": null,
        "description": "This course offers an overview of fundamental financial analyses, such as time value of money, interest rates, basic valuation of cash flow streams, and basic stock and bond valuation. The content is relevant to understand a broad class of problems and decisions for businesses or individuals. It offers applications across decision domains. The teaching materials include online problem solving and case writing. Students may not take SM132 and FE101 for credit.",
        "credit": "2",
        "hub credit": null
    },
    "qstsm131": {
        "prereq": "Required of all Questrom 1st-semester freshmen. Open to non-Questrom students who have completed a semester of FT work at BU.",
        "coreq": null,
        "description": "This course explores local and global ethical problems that managers face in markets for goods, services, labor, or capital. Through identification and discussion of the basic business disciplines, students uncover the interdependencies in the creation, delivery and capture of value. Students explore the complex analyses necessary to make ethical decisions vis-?-vis a multiplicity of stakeholders and in service of diverse personal and institutional goals. Stresses written and oral communication skills and logical reasoning as an ingredient for sound analysis and rational business planning. Effective Fall 2018, this course fulfills a single unit in the following BU Hub area: Ethical Reasoning.",
        "credit": "4",
        "hub credit": [
            "Ethical Reasoning"
        ]
    },
    "cdsds120": {
        "prereq": "Basic knowledge of a programming language such as Python is expected",
        "coreq": "CDSDS110 OR equivalent.",
        "description": "The first in a 3-course sequence (with CDS DS 121 and CDS DS 122) that introduces students to theoretical foundations of Data Science. Introduction to key concepts from Calculus (differentiation and integration), Probability (discrete and continuous random variables) and Linear Algebra (vector spaces, matrices, and linear systems). The course links mathematics and computational thinking through problem sets requiring students to answer mathematically- posed questions using computation.",
        "credit": "4",
        "hub credit": [
            "Quantitative Reasoning I"
        ]
    },
    "cgsss201": {
        "prereq": "First Year Writing Seminar (e.g., WR 100 or WR 120)",
        "coreq": null,
        "description": "SS201 explores the historical roots of our global political and economic scene from a comparative perspective. Students will examine the radical movements, ideologies, and revolutions that have shaped the contemporary world, focusing on a comparison of two or more nations or regions. Topics may include the history and power of nationalism, the legacy of imperialism, competing political ideologies, the rise of authoritarian and totalitarian regimes, terrorism and state violence, and the role popular collective action plays in effecting change. Effective Fall 2018, this course fulfills a single unit in each of the following BU Hub areas: Historical Consciousness, Global Citizenship and Intercultural Literacy, Research and Information Literacy. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Global Citizenship and Intercultural Literacy, Writing-Intensive Course, Research and Information Literacy.",
        "credit": "4",
        "hub credit": [
            "Global Citizenship and Intercultural Literacy",
            "Research and Information Literacy",
            "Writing-Intensive Course"
        ]
    },
    "cgsns201": {
        "prereq": null,
        "coreq": null,
        "description": "Focuses on the major paradigms (and shifts) including the origin of life, molecular and cellular theories of life, human origins, genetics, evolutionary theory and biodiversity. Encourages use of quantitative and scientific tools required to explore scientific models and connects the scientific process with ethical and social concerns arising from our understanding of the origin, evolution and diversity of life including our own species. Effective Fall 2018, this course fulfills a single unit in each of the following BU Hub areas: Scientific Inquiry I, Quantitative Reasoning I, Critical Thinking.",
        "credit": "4",
        "hub credit": [
            "Scientific Inquiry I",
            "Quantitative Reasoning I",
            "Critical Thinking"
        ]
    },
    "cascs111": {
        "prereq": null,
        "coreq": null,
        "description": "The first course for computer science majors and anyone seeking a rigorous introduction. Develops computational problem-solving skills by programming in the Python language, and exposes students to variety of other topics from computer science and its applications. Carries MCS divisional credit in CAS. Effective Fall 2018, this course fulfills a single unit in each of the following BU Hub areas: Quantitative Reasoning II, Creativity/Innovation, Critical Thinking.",
        "credit": "4",
        "hub credit": [
            "Quantitative Reasoning II",
            "Critical Thinking",
            "Creativity/Innovation"
        ]
    },
    "cgsrh104": {
        "prereq": null,
        "coreq": null,
        "description": "Through class discussion and learning experiences, students explore connections between readings assigned in Rhetoric and those in other courses, focusing on themes drawn from the two units that comprise the semester's curriculum. The course further develops skills in expository writing and introduces exploratory essay writing. Students continue to explore the contemporary relevance and meaning of the interdisciplinary curriculum. Students refine their skills in grammar, style, organization, and document design. Effective Fall 2018, this course fulfills a single unit in the following BU Hub areas: First-Year Writing Seminar, Digital/Multimedia Expression, Critical Thinking.",
        "credit": "4",
        "hub credit": [
            "First-Year Writing Seminar",
            "Digital/Multimedia Expression",
            "Critical Thinking"
        ]
    },
    "cgshu104": {
        "prereq": null,
        "coreq": null,
        "description": "This course is an interdisciplinary approach to literature and art history. The course focuses on the 19th and 20th centuries and concludes with the technologically complex 21st century. Assignments encourage research skills, critical thinking, and contextual awareness. Trips to historically and culturally important sites enhance the course's experiential component and augment the humanities' interdisciplinary significance. Effective Fall 2018, this course fulfills a single unit in the following BU Hub areas: Aesthetic Exploration, Historical Consciousness, Critical Thinking.",
        "credit": "5",
        "hub credit": [
            "Aesthetic Exploration",
            "Historical Consciousness",
            "Critical Thinking"
        ]
    },
    "cgsss104": {
        "prereq": null,
        "coreq": null,
        "description": "This interdisciplinary course examines social change in the politics, economies, social structures, and culture of the West from the Industrial Revolution to the present. Students consider the impact of technological innovation, industrial capitalism, global war, genocide, and the ideologies that shaped these developments. The course concludes with the globalization of economies and social structures in an era of rising inequality. Visits to relevant sites will supplement classroom instruction. One lecture, two discussions, and two additional contact hours as assigned. [5 cr.] Effective Fall 2018, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry II, Global Citizenship and Intercultural Literacy, Critical Thinking.",
        "credit": "5",
        "hub credit": [
            "Global Citizenship and Intercultural Literacy",
            "Social Inquiry II",
            "Critical Thinking"
        ]
    },
    "cdsds100": {
        "prereq": null,
        "coreq": null,
        "description": "This course introduces students to three perspectives that are fundamental to their ability to reason with data: critical thinking, inferential thinking, and computational thinking. Through data modeling and visualization, students will construct and communicate arguments that are rooted in data. The course expects only basic computer knowledge and teaches concepts and skills in computer programming (Python), linear regression, and statistical inference. The course delves into dilemmas surrounding data analysis, such as balancing individual privacy and social utility, and prepares students for the data driven world all around us. Students with interests from politics to sports, finance to journalism, entrepreneurship to smart cities, etc., can use the knowledge of data science they gain in this class to enhance those interests. Not to mention a grounding for students who want to pursue the field of data science itself. Effective Fall 2021, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry 1, Digital/Multimedia Expression, Research and Information Literacy.",
        "credit": "4",
        "hub credit": [
            "Social Inquiry I",
            "Digital/Multimedia Expression",
            "Research and Information Literacy"
        ]
    },
    "cgshu103": {
        "prereq": null,
        "coreq": null,
        "description": "The course examines key figures and works in literary and artistic traditions from the ancient and classical periods through the Renaissance, concluding with a focus on the Enlightenment and Romanticism. The semester's units concentrate on how the works reflect cultural ideals and developments and on how they represent evolving aesthetic standards that have shaped conventions in literature and the arts. Coursework and assignments include learning trips to various sites of historical and cultural significance in the Boston area to emphasize the Humanities' relevance beyond the classroom. Effective Fall 2018, this course fulfills a single unit in each of the following BU Hub areas: Aesthetic Exploration, Historical Consciousness, Critical Thinking.",
        "credit": "5",
        "hub credit": [
            "Aesthetic Exploration",
            "Historical Consciousness",
            "Critical Thinking"
        ]
    },
    "cgsss103": {
        "prereq": null,
        "coreq": null,
        "description": "This interdisciplinary course examines social change in the politics, economies, social structures, and culture of the West from the ancient world through the Enlightenment. Students look at developments in governance, trade, social inequalities, and ideas that gave the West its distinctive character, including the rise of its key institution, democracy. To interpret historical change critically, students are introduced to the social science \"toolkit\" of analytical concepts. Assignments outside the classroom will encourage students to consider how history has shaped today's world. Effective Fall 2018, this course fulfills a single unit in each of the following BU Hub areas: Social Inquiry I, The Individual in Community, Critical Thinking.",
        "credit": "5",
        "hub credit": [
            "Social Inquiry I",
            "The Individual in Community",
            "Critical Thinking"
        ]
    },
    "cgsrh103": {
        "prereq": null,
        "coreq": null,
        "description": "In Rhetoric 103, you will be taken chronologically through key periods in history to learn about the origin and development of the art of Rhetoric and its relevance today, ultimately in order to enable you to apply key rhetorical skills to your own textual and verbal practice. Students will receive semester-long instruction and practice in writing, oral communication, and research and information literacy. Effective Fall 2018, this course fulfills a single unit in the following BU Hub areas: Writing, Research, and Inquiry, Oral and/or Signed Communication, Research and Information Literacy.",
        "credit": "4",
        "hub credit": [
            "Writing, Research, and Inquiry",
            "Oral and/or Signed Communication",
            "Research and Information Literacy"
        ]
    }
}